01.column_bc.org

#+TITLE:     column-bc
#+SETUPFILE: ./setup/setup_theme.org



* Υπολογισμός ραβδου (BC)

Η δοκός καταπονείται (BC) σε εφελκυσμό.

Οι εξισώσεις του εφελκυσμού είναι:

$$\sigma = \frac{P}{A}$$

$$\epsilon = \frac{\sigma}{E}$$

$$\delta = \frac{P \times l}{A \times E}$$


#+tblname: area_bc
|                        |                  |         |      |                           |
|------------------------+------------------+---------+------+---------------------------|
| Μήκος ράβδου           |                  |    3150 | mm   |                           |
| P                      | $C = 2 \times W$ |   54.28 | kΝ   | εφελκυσμός στη ραβδο (ΒC) |
| Τάση διαρροής (0.2%) : | $\sigma$         |     370 | MPa  |                           |
|------------------------+------------------+---------+------+---------------------------|
| Επιφάνεια δοκού        | $Α=\dfrac{P}{c}$ | 1.46e-4 | m^2  |                           |
|                        |                  |    1.46 | cm^2 |                           |
|------------------------+------------------+---------+------+---------------------------|
| ενταση:                | $\epsilon=\dfrac{\sigma}{Ε}$ | 0.00185 |      |                           |
| Μετατόπιση:            |                  |    5.82 | mm   |                           |

Επομένως στο όριο της δύναμης και τάση διαρροής, η διάμετρος πρέπει να έχει επιφάνεια: $Α:1.46\times10^{(-4)}m^2$


** Επιλογή ράβδου

Η ράβδος (ΒC) επιλέγεται από τον πίνακα
https://www.nspc.nipponsteel.com/en/products/building_kenchiku.html


| Εξωτερική διάμετρος | Παχος [t] | μαζα [m] | Επιφάνεια [Α] | Ροπή αδράνειας [I] | Section modulus | Radius of gyration |
| mm                  | mm        |     Kg/m |          cm^2 |               cm^4 |            cm^3 |                 cm |
|---------------------+-----------+----------+---------------+--------------------+-----------------+--------------------|
| 21.7                | 2.3       |     1.10 |         1.402 |              0.669 |           0.616 |              0.691 |
| 27.2                | 1.9       |     1.19 |         1.510 |               1.22 |           0.893 |              0.897 |
| *27.2*              | *2.3*     |     1.41 |         1.799 |               1.41 |            1.03 |              0.884 |

H μικρότερη ράβδος που καλύπτει την αντοχή επιφάνειας με $Α>1.46cm^2$ είναι η ράβδος 27.2x1.9 με μήκος 3150mm

Επιλέγουμε την 27.2x2.3

|                     |                 |
|---------------------+-----------------|
| Ειδός               | σωλήνα 27.3x2.3 |
| Εξωτερική διάμετρος |            27.2 |
| Πάχος               |             2.3 |
| Εσωτερική           |            22.6 |
#+TBLFM: @5$2=@3-2*@4


** maxima                                                          :noexport:

programmode:false;

#+name: tension_maxima
#+begin_src maxima :results output html :export result :results raw :drawer EXPORT_HTML
fpprintprec:3$

eq1: sigma = P/A$
print(tex(eq1));

eq2: e = sigma / E$
print(tex(eq2));

eq3: delta = (P*l) / (A*E)$
print(tex(eq3))$

eq10a:solve(eq1,A)$
print(tex(eq10a));

P:54.28$
print("$$P:",P,"kN$$");

sigma:370$
print("$$σ:",370,"MPa$$");

A:(P*10^3) / (sigma*10^6) $
print("$$A:",A,"m^2$$");

E:200*10^9$
epsilon:sigma/E$
epsilon:(sigma*10^6) / E,numer$
print("$$ε:",epsilon,"$$");

l:3150$
delta: P*l / (A*E);
print("$$delta:",delta,"m$$");
#+end_src



false 
$$P: 54.2 kN$$ 
$$σ: 370 MPa$$ 
$$A: 1.46E-4 m^2$$ 
$$ε: 0.00185 $$ 
$$delta: 0.00582 m$$ 




* Υπολογισμός κοχλία προέντασης






Τοποθετείται κοχλία, ώστε η ράβδος να βρίσκεται σε προένταση.

Το φόρτιο της ράβδου BC υπολογίστηκε από το χωροδικτύωμα:
$$P=54,28κΝ$$


#+tblname: bolt_design
|      | Tensile |  Shear |          Fv | Punch |
|------+---------+--------+-------------+-------|
| Size |     8.8 |    8.8 | S355 / ≥5.6 |       |
|------+---------+--------+-------------+-------|
| M5   |    8.18 |   5.45 |         4.9 |  6.37 |
| M6   |    11.6 |   7.72 |        5.88 |  7.96 |
| M7   |    16.6 |   11.1 |        6.86 |  8.76 |
| M8   |    21.1 |   14.1 |        7.84 | 10.35 |
| M10  |    33.4 |   22.3 |         9.8 | 12.74 |
| M12  |    48.6 |   32.4 |       11.76 | 14.33 |
| M14  |  *66.2* |   44.2 |       13.72 | 16.72 |
| M16  |    90.4 | *60.3* |       15.68 | 19.11 |
| M18  |   110.6 |   73.7 |       17.64 | 21.49 |
| M20  |   141.1 |   94.1 |        19.6 | 23.88 |
| M22  |   174.5 |  116.4 |       21.56 | 27.07 |
| M24  |   203.3 |  135.6 |       23.52 | 28.66 |
| M27  |   264.4 |  176.3 |       26.46 | 32.64 |
| M30  |   323.1 |  215.4 |        29.4 | 36.62 |
| M33  |   399.7 |  266.5 |       32.34 |  39.8 |
| M36  |   470.6 |  313.7 |       35.28 | 43.78 |
| M39  |   562.2 |  374.8 |       38.22 | 47.76 |



https://eurocodeapplied.com/design/en1993/bolt-design-properties
Από τον πίνακα της πηγής 1 είναι:

| Είδος              |         |
|--------------------+---------|
| Κοχλίας προέντασης | Μ14 8.8 |
| Κοχλίας κάμψης     | Μ16 8.8 |
