html/01.column_bc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="el" xml:lang="el">
<head>
<!-- 2023-04-25 Tue 16:22 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>cost-kdsa</title>
<meta name="keywords" content="o" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/hideshow.css"/>
<style> li{max-width:800px;}</style

</head>
<body>
<div id="content" class="content">
<h1 class="title">cost-kdsa</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb052dc3">1. Υπολογισμός ραβδου (BC)</a>
<ul>
<li><a href="#org650c942">1.1. Επιλογή ράβδου</a></li>
<li><a href="#org0ebbd21">1.2. maxima</a></li>
</ul>
</li>
<li><a href="#orgd2cf29f">2. Υπολογισμός κοχλία προέντασης</a></li>
</ul>
</div>
</div>



<div id="outline-container-orgb052dc3" class="outline-2">
<h2 id="orgb052dc3"><span class="section-number-2">1.</span> Υπολογισμός ραβδου (BC)</h2>
<div class="outline-text-2" id="text-1">
<p>
Η δοκός καταπονείται (BC) σε εφελκυσμό.<br />
</p>

<p>
Οι εξισώσεις του εφελκυσμού είναι:<br />
</p>

<p>
\[\sigma = \frac{P}{A}\]<br />
</p>

<p>
\[\epsilon = \frac{\sigma}{E}\]<br />
</p>

<p>
\[\delta = \frac{P \times l}{A \times E}\]<br />
</p>


<table id="org1e36110" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Μήκος ράβδου</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">3150</td>
<td class="org-left">mm</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">P</td>
<td class="org-left">\(C = 2 \times W\)</td>
<td class="org-right">54,28</td>
<td class="org-left">kΝ</td>
<td class="org-left">εφελκυσμός στη ραβδο (ΒC)</td>
</tr>

<tr>
<td class="org-left">Τάση διαρροής (0,2%) :</td>
<td class="org-left">σ</td>
<td class="org-right">370</td>
<td class="org-left">MPa</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Επιφάνεια δοκού</td>
<td class="org-left">\(Α=P/c\)</td>
<td class="org-right">1,46e-4</td>
<td class="org-left">m<sup>2</sup></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">1,46</td>
<td class="org-left">cm<sup>2</sup></td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">ενταση:</td>
<td class="org-left">\(ε=σ/Ε\)</td>
<td class="org-right">0,00185</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Μετατόπιση:</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">5,82</td>
<td class="org-left">mm</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
<p>
Επομένως στο όριο της δύναμης και τάση διαρροής, η διάμετρος πρέπει να έχει επιφάνεια: \(Α:1.46\times10^{(-4)}m^2\)<br />
</p>
</div>


<div id="outline-container-org650c942" class="outline-3">
<h3 id="org650c942"><span class="section-number-3">1.1.</span> Επιλογή ράβδου</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Η ράβδος (ΒC) επιλέγεται από τον πίνακα<br />
<a href="https://www.nspc.nipponsteel.com/en/products/building_kenchiku.html">https://www.nspc.nipponsteel.com/en/products/building_kenchiku.html</a><br />
</p>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Εξωτερική διάμετρος</th>
<th scope="col" class="org-left">Παχος [t]</th>
<th scope="col" class="org-right">μαζα [m]</th>
<th scope="col" class="org-right">Επιφάνεια [Α]</th>
<th scope="col" class="org-right">Ροπή αδράνειας [I]</th>
<th scope="col" class="org-right">Section modulus</th>
<th scope="col" class="org-right">Radius of gyration</th>
</tr>

<tr>
<th scope="col" class="org-left">mm</th>
<th scope="col" class="org-left">mm</th>
<th scope="col" class="org-right">Kg/m</th>
<th scope="col" class="org-right">cm<sup>2</sup></th>
<th scope="col" class="org-right">cm<sup>4</sup></th>
<th scope="col" class="org-right">cm<sup>3</sup></th>
<th scope="col" class="org-right">cm</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">21,7</td>
<td class="org-left">2,3</td>
<td class="org-right">1,10</td>
<td class="org-right">1,402</td>
<td class="org-right">0,669</td>
<td class="org-right">0,616</td>
<td class="org-right">0,691</td>
</tr>

<tr>
<td class="org-left">27,2</td>
<td class="org-left">1,9</td>
<td class="org-right">1,19</td>
<td class="org-right">1,510</td>
<td class="org-right">1,22</td>
<td class="org-right">0,893</td>
<td class="org-right">0,897</td>
</tr>

<tr>
<td class="org-left"><b>27,2</b></td>
<td class="org-left"><b>2,3</b></td>
<td class="org-right">1,41</td>
<td class="org-right">1,799</td>
<td class="org-right">1,41</td>
<td class="org-right">1,03</td>
<td class="org-right">0,884</td>
</tr>
</tbody>
</table>

<p>
H μικρότερη ράβδος που καλύπτει την αντοχή επιφάνειας με \(Α>1.46cm^2\) είναι η ράβδος 27.2x1.9 με μήκος 3150mm<br />
</p>

<p>
Επιλέγουμε την 27.2x2.3<br />
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-right">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Ειδός</td>
<td class="org-right">σωλήνα 27,3x2,3</td>
</tr>

<tr>
<td class="org-left">Εξωτερική διάμετρος</td>
<td class="org-right">27,2</td>
</tr>

<tr>
<td class="org-left">Πάχος</td>
<td class="org-right">2,3</td>
</tr>

<tr>
<td class="org-left">Εσωτερική</td>
<td class="org-right">22,6</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-org0ebbd21" class="outline-3">
<h3 id="org0ebbd21"><span class="section-number-3">1.2.</span> maxima</h3>
<div class="outline-text-3" id="text-1-2">
<p>
programmode:false;<br />
</p>

<div class="org-src-container">
<pre class="src src-maxima" id="orgbecd282">fpprintprec<span style="color: #859900;">:</span>3$

eq1<span style="color: #859900;">:</span> sigma <span style="color: #859900;">=</span> P<span style="color: #859900;">/</span>A$
<span style="color: #ffff00;">print</span>(<span style="color: #ffff00;">tex</span>(eq1));

eq2<span style="color: #859900;">:</span> e <span style="color: #859900;">=</span> sigma <span style="color: #859900;">/</span> E$
<span style="color: #ffff00;">print</span>(<span style="color: #ffff00;">tex</span>(eq2));

eq3<span style="color: #859900;">:</span> <span style="color: #ffff00;">delta</span> <span style="color: #859900;">=</span> (P<span style="color: #859900;">*</span>l) <span style="color: #859900;">/</span> (A<span style="color: #859900;">*</span>E)$
<span style="color: #ffff00;">print</span>(<span style="color: #ffff00;">tex</span>(eq3))$

eq10a<span style="color: #859900;">:</span><span style="color: #ffff00;">solve</span>(eq1,A)$
<span style="color: #ffff00;">print</span>(<span style="color: #ffff00;">tex</span>(eq10a));

P<span style="color: #859900;">:</span><span style="color: #2aa198;">54</span><span style="color: #859900;">.</span>28$
<span style="color: #ffff00;">print</span>(<span style="color: #eedfcc;">"$$P:"</span>,P,<span style="color: #eedfcc;">"kN$$"</span>);

sigma<span style="color: #859900;">:</span>370$
<span style="color: #ffff00;">print</span>(<span style="color: #eedfcc;">"$$&#963;:"</span>,<span style="color: #2aa198;">370</span>,<span style="color: #eedfcc;">"MPa$$"</span>);

A<span style="color: #859900;">:</span>(P<span style="color: #859900;">*</span><span style="color: #2aa198;">10</span><span style="color: #859900;">^</span><span style="color: #2aa198;">3</span>) <span style="color: #859900;">/</span> (sigma<span style="color: #859900;">*</span><span style="color: #2aa198;">10</span><span style="color: #859900;">^</span><span style="color: #2aa198;">6</span>) $
<span style="color: #ffff00;">print</span>(<span style="color: #eedfcc;">"$$A:"</span>,A,<span style="color: #eedfcc;">"m^2$$"</span>);

E<span style="color: #859900;">:</span><span style="color: #2aa198;">200</span><span style="color: #859900;">*</span><span style="color: #2aa198;">10</span><span style="color: #859900;">^</span>9$
epsilon<span style="color: #859900;">:</span>sigma<span style="color: #859900;">/</span>E$
epsilon<span style="color: #859900;">:</span>(sigma<span style="color: #859900;">*</span><span style="color: #2aa198;">10</span><span style="color: #859900;">^</span><span style="color: #2aa198;">6</span>) <span style="color: #859900;">/</span> E,numer$
<span style="color: #ffff00;">print</span>(<span style="color: #eedfcc;">"$$&#949;:"</span>,epsilon,<span style="color: #eedfcc;">"$$"</span>);

l<span style="color: #859900;">:</span>3150$
<span style="color: #ffff00;">delta</span><span style="color: #859900;">:</span> P<span style="color: #859900;">*</span>l <span style="color: #859900;">/</span> (A<span style="color: #859900;">*</span>E);
<span style="color: #ffff00;">print</span>(<span style="color: #eedfcc;">"$$delta:"</span>,<span style="color: #ffff00;">delta</span>,<span style="color: #eedfcc;">"m$$"</span>);
</pre>
</div>


<p>
\[\sigma={{P}\over{A}}\]<br />
false<br />
\[e={{\sigma}\over{E}}\]<br />
false<br />
\[\delta={{P\,l}\over{A\,E}}\]<br />
false<br />
\[\left[ A={{P}\over{\sigma}} \right] \]<br />
false<br />
\[P: 54.2 kN\] <br />
\[σ: 370 MPa\] <br />
\[A: 1.46E-4 m^2\] <br />
\[ε: 0.00185 \] <br />
\[delta: 0.00582 m\] <br />
</p>
</div>
</div>
</div>




<div id="outline-container-orgd2cf29f" class="outline-2">
<h2 id="orgd2cf29f"><span class="section-number-2">2.</span> Υπολογισμός κοχλία προέντασης</h2>
<div class="outline-text-2" id="text-2">
<p>
Τοποθετείται κοχλία, ώστε η ράβδος να βρίσκεται σε προένταση.<br />
</p>

<p>
Το φόρτιο της ράβδου BC υπολογίστηκε από το χωροδικτύωμα:<br />
\[P=54,28κΝ\]<br />
</p>


<table id="orgd046c17" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-right">&#xa0;</th>
</tr>

<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-right">Tensile</th>
<th scope="col" class="org-right">Shear</th>
<th scope="col" class="org-right">Fv</th>
<th scope="col" class="org-right">Punch</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Size</td>
<td class="org-right">8,8</td>
<td class="org-right">8,8</td>
<td class="org-right">S355 / ≥5,6</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">M5</td>
<td class="org-right">8,18</td>
<td class="org-right">5,45</td>
<td class="org-right">4,9</td>
<td class="org-right">6,37</td>
</tr>

<tr>
<td class="org-left">M6</td>
<td class="org-right">11,6</td>
<td class="org-right">7,72</td>
<td class="org-right">5,88</td>
<td class="org-right">7,96</td>
</tr>

<tr>
<td class="org-left">M7</td>
<td class="org-right">16,6</td>
<td class="org-right">11,1</td>
<td class="org-right">6,86</td>
<td class="org-right">8,76</td>
</tr>

<tr>
<td class="org-left">M8</td>
<td class="org-right">21,1</td>
<td class="org-right">14,1</td>
<td class="org-right">7,84</td>
<td class="org-right">10,35</td>
</tr>

<tr>
<td class="org-left">M10</td>
<td class="org-right">33,4</td>
<td class="org-right">22,3</td>
<td class="org-right">9,8</td>
<td class="org-right">12,74</td>
</tr>

<tr>
<td class="org-left">M12</td>
<td class="org-right">48,6</td>
<td class="org-right">32,4</td>
<td class="org-right">11,76</td>
<td class="org-right">14,33</td>
</tr>

<tr>
<td class="org-left">M14</td>
<td class="org-right"><b>66,2</b></td>
<td class="org-right">44,2</td>
<td class="org-right">13,72</td>
<td class="org-right">16,72</td>
</tr>

<tr>
<td class="org-left">M16</td>
<td class="org-right">90,4</td>
<td class="org-right"><b>60,3</b></td>
<td class="org-right">15,68</td>
<td class="org-right">19,11</td>
</tr>

<tr>
<td class="org-left">M18</td>
<td class="org-right">110,6</td>
<td class="org-right">73,7</td>
<td class="org-right">17,64</td>
<td class="org-right">21,49</td>
</tr>

<tr>
<td class="org-left">M20</td>
<td class="org-right">141,1</td>
<td class="org-right">94,1</td>
<td class="org-right">19,6</td>
<td class="org-right">23,88</td>
</tr>

<tr>
<td class="org-left">M22</td>
<td class="org-right">174,5</td>
<td class="org-right">116,4</td>
<td class="org-right">21,56</td>
<td class="org-right">27,07</td>
</tr>

<tr>
<td class="org-left">M24</td>
<td class="org-right">203,3</td>
<td class="org-right">135,6</td>
<td class="org-right">23,52</td>
<td class="org-right">28,66</td>
</tr>

<tr>
<td class="org-left">M27</td>
<td class="org-right">264,4</td>
<td class="org-right">176,3</td>
<td class="org-right">26,46</td>
<td class="org-right">32,64</td>
</tr>

<tr>
<td class="org-left">M30</td>
<td class="org-right">323,1</td>
<td class="org-right">215,4</td>
<td class="org-right">29,4</td>
<td class="org-right">36,62</td>
</tr>

<tr>
<td class="org-left">M33</td>
<td class="org-right">399,7</td>
<td class="org-right">266,5</td>
<td class="org-right">32,34</td>
<td class="org-right">39,8</td>
</tr>

<tr>
<td class="org-left">M36</td>
<td class="org-right">470,6</td>
<td class="org-right">313,7</td>
<td class="org-right">35,28</td>
<td class="org-right">43,78</td>
</tr>

<tr>
<td class="org-left">M39</td>
<td class="org-right">562,2</td>
<td class="org-right">374,8</td>
<td class="org-right">38,22</td>
<td class="org-right">47,76</td>
</tr>
</tbody>
</table>



<p>
<a href="https://eurocodeapplied.com/design/en1993/bolt-design-properties">https://eurocodeapplied.com/design/en1993/bolt-design-properties</a><br />
Από τον πίνακα της πηγής 1 είναι:<br />
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Είδος</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Κοχλίας προέντασης</td>
<td class="org-left">Μ14 8,8</td>
</tr>

<tr>
<td class="org-left">Κοχλίας κάμψης</td>
<td class="org-left">Μ16 8,8</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</body>
</html>